## Plan Result (Infrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.ptlsbox_managed_identity_access_policy
  * azurerm_user_assigned_identity.ptlsbox_managed_identity
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;7a1203c4-1443-46d8-96c4-496492196efd&#34;]
* Delete
  * azurerm_key_vault_access_policy.implicit_managed_identity_access_policy




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.implicit_managed_identity_access_policy will be destroyed
  # (because azurerm_key_vault_access_policy.implicit_managed_identity_access_policy is not in configuration)
  - resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/7a1203c4-1443-46d8-96c4-496492196efd" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "7a1203c4-1443-46d8-96c4-496492196efd" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.ptlsbox_managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "ptlsbox_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.ptlsbox_managed_identity will be created
  + resource "azurerm_user_assigned_identity" "ptlsbox_managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "monitoring-cftsbox-intsvc-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-cftsbox-intsvc-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["7a1203c4-1443-46d8-96c4-496492196efd"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + object_id               = "7a1203c4-1443-46d8-96c4-496492196efd"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":164,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->